Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetMapOfSizesForStraights(System.Collections.Generic.ISet{Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap})
Set the mapping for sizes of fabrication part straights to change the sizes to.
fabricationPartSizeMaps:
The map containing the original straights size to the mapped sizes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetMapOfInLinePartTypes(System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId})
Set the mapping of fabrication part types for in-line parts for the service and palette to change to.
fabricationPartTypes:
The map containing the original fabrication part type to the fabrication part type to change to.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetRestrictPalette(System.Boolean)
Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier.
Since:
2022

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetPaletteId(System.Int32)
Set the fabrication palette identifier to change the elements to.
Since:
2022

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetSelection(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set the element selection to change the service or size for.
selection:
The set of element identifiers of fabrication parts to change the service or size for.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ApplyChange
Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetElementsThatFailed to get a set of fabrication part element identifiers that had failures.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ChangeSize(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Collections.Generic.ISet{Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap})
Changes the size of the selection of fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetElementsThatFailed to get a set of fabrication part element identifiers that had failures.
selection:
The set of element identifiers of fabrication parts to change the size for.
fabricationPartSizeMaps:
The map containing the original sizes for the straights to the new sizes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
-or-
The fabrication size map is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ChangeService(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32,System.Int32,System.Boolean)
Changes the service of the selection of fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetElementsThatFailed to get a set of fabrication part element identifiers that had failures.
selection:
The set of element identifiers of fabrication parts to change the service for.
serviceId:
The identifier of the fabrication service.
paletteId:
The identifier of the fabrication palette.
restrictPalette:
Restrict the placement of parts to the passed in palette identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2020

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ChangeService(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32,System.Int32)
Changes the service of the selection of fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetElementsThatFailed to get a set of fabrication part element identifiers that had failures.
selection:
The set of element identifiers of fabrication parts to change the service for.
serviceId:
The identifier of the fabrication service.
paletteId:
The identifier of the fabrication palette.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.#ctor(Autodesk.Revit.DB.Document)
Creates a new instance of the FabricationNetworkChangeService class.
document:
A document in which to change the service or size of the selected fabrication parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService
This class represents the fabrication part change service and change size tools.
Remarks:
After a new instance of the class is created, call the ChangeService method to change the service of the
fabrication parts or call the ChangeSize method to change the size of the fabrication parts. There is another
workflow allowing for more control, call SetSelection to set the selection of fabrication parts to change. To change
the service, call SetServiceId and SetPaletteId to set the service identifier and palette identifier. Changing
the service there is an optional methods GetInLinePartTypes and SetMapOfSizesForStraights that can be called
to replace in-line valves and dampers to the corresponding parts for the new service. The size can also be changed by calling
GetMapOfAllSizesForStraights that will return a FabricationPartSizeMapSet containing a map of sizes for all straights
found in the selection of fabrication parts. The FabricationPartSizeMapSet can then be modified to set the mapped values for
the new size for the fabrication part straights and then call SetMapOfSizesForStraights set the new sizes that are to
be applied. Finally call ApplyChange to apply the previously set parameters to the selection of fabrication parts.
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetElementsThatFailed to get a set of fabrication part element identifiers that had failures.
Since:
2018.2